package main

import "fmt"

// 位运算
func main() {

	// 负数第一位1是符号位

	// 1000 0011   -3原码
	// 1111 1100   -3反码
	// 1111 1101   -3补码
	// 0000 0011    3补码
	// 1111 1110   异或计算得到补码
	// 1111 1101   补码-1
	// 1000 0010   取反得到结果原码，换算位10进制 -2
	fmt.Println(-3 ^ 3)

	// 1000 0001  -1原码
	// 1111 1110  -1反码
	// 1111 1111  -1补码
	// 1111 1100  左移2位
    // 1111 1011  补码-1
    // 1000 0100  取反
	fmt.Println(-2 << 2)
	fmt.Println(-1 >> 2)

	fmt.Println(2 & 3 )
	fmt.Println(3 | 4 )
	// 0000 0100
	// 0000 0011
   //  0000 0111
	//1000 0100
	//1111 1011
	//1111 1110
   // 0011 1111
   // 0011 1110
   // 1100 0001


}
